{
  "products": [
    {
      "id": "45231",
      "name": "Organic Tomatoes",
      "Category": "Vegetables",
      "imgUrl": "https://images.freeimages.com/images/large-previews/786/tomatoes-1323819.jpg?fmt=webp&h=350",
      "description": "These organic tomatoes are grown in a pesticide-free environment, ensuring you get the freshest and healthiest produce. Perfect for salads, sauces, or simply snacking on, these tomatoes are bursting with flavor and nutrients. Picked at peak ripeness, they are rich in antioxidants and vitamins, promoting overall well-being.",
      "price": 20,
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "76895",
      "name": "Bananas",
      "Category": "Fruits",
      "imgUrl": "https://images.freeimages.com/images/large-previews/f13/fruit-1182041.jpg?fmt=webp&w=500",
      "description": "Indulge in the natural sweetness of these ripe bananas. Whether added to smoothies, baked into bread, or enjoyed as a healthy snack on-the-go, bananas are a versatile fruit loved by all ages. High in potassium and fiber, they support heart health and digestion. These bananas are sourced from sustainable farms, ensuring both quality and environmental responsibility.",
      "price": 4,
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "61127",
      "name": "Fresh Carrots",
      "imgUrl": "https://images.freeimages.com/images/large-previews/ada/carrots-1324313.jpg?fmt=webp&w=500",
      "description": "These vibrant, fresh carrots are a must-have in any kitchen. Whether roasted, steamed, or eaten raw, carrots add a pop of color and a burst of nutrition to any meal. Rich in beta-carotene, they promote healthy vision and glowing skin. Sourced from local farms, these carrots are as fresh as they come, straight from the earth to your table.",
      "price": 1.79,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": false,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "51234",
      "name": "Organic Apples",
      "imgUrl": "https://images.freeimages.com/images/large-previews/9ec/apples-2-1194559.jpg?fmt=webp&w=500",
      "description": "Crisp and delicious, these organic apples are nature's perfect snack. Grown without synthetic pesticides or fertilizers, they offer pure, unadulterated flavor with every bite. Apples are not only refreshing but also packed with vitamins and dietary fiber, making them an essential part of a healthy diet. Enjoy them sliced with nut butter, baked into pies, or simply enjoyed on their own.",
      "price": 4.29,
      "Category": "Fruits",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "89642",
      "name": "Organic Spinach",
      "imgUrl": "https://images.freeimages.com/images/large-previews/715/fruits-shot-2-1537531.jpg?fmt=webp&w=500",
      "description": "Packed with vitamins and minerals, organic spinach is a nutritional powerhouse. Whether sautéed, blended into smoothies, or tossed into salads, spinach adds a burst of freshness and vibrant green color to any dish. Grown without synthetic chemicals, our organic spinach is not only better for you but also better for the environment. Elevate your meals with this versatile and nutrient-rich leafy green.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 5,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": true
    },
    {
      "id": "74123",
      "name": "Watermelon",
      "imgUrl": "https://images.freeimages.com/images/large-previews/98c/watermelon-1506864.jpg?fmt=webp&w=500",
      "description": "Quench your thirst and satisfy your sweet tooth with juicy watermelon. Perfect for picnics, barbecues, or simply enjoying on a hot summer day, watermelon is a refreshing treat for all occasions. Rich in hydration and vitamins A and C, this fruit not only tastes delicious but also supports overall health and hydration. Our watermelons are handpicked for optimal ripeness and flavor.",
      "price": 5.99,
      "Category": "Fruits",
      "rate": 4,
      "Organic": false,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "34789",
      "name": "Organic Blueberries",
      "imgUrl": "https://images.freeimages.com/images/large-previews/f13/fruit-1182041.jpg?fmt=webp&w=500",
      "description": " Bursting with flavor and antioxidants, these organic blueberries are a delightful addition to your breakfast or snack time. Grown without synthetic pesticides, they offer pure, natural goodness in every bite. Blueberries are not only delicious but also incredibly nutritious, promoting brain health, heart health, and radiant skin. Enjoy them fresh, frozen, or blended into smoothies for a tasty and nutritious boost.",
      "price": 3.49,
      "Category": "Fruits",
      "rate": 5,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "12876",
      "name": "Sweet Potatoes",
      "imgUrl": "https://images.freeimages.com/images/large-previews/9b3/potatoes-1325508.jpg?fmt=webp&w=500",
      "description": "Add a touch of sweetness to your meals with these delicious sweet potatoes. Whether roasted, mashed, or baked, sweet potatoes offer a nutritious and flavorful alternative to regular potatoes. Packed with vitamins, minerals, and dietary fiber, they support a healthy immune system and digestion. Our sweet potatoes are locally sourced and carefully selected for their quality and freshness.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": true
    },
    {
      "id": "22987",
      "name": "Fresh Strawberries",
      "Category": "Fruits",
      "imgUrl": "https://images.freeimages.com/images/large-previews/f13/fruit-1182041.jpg?fmt=webp&w=500",
      "description": "Indulge in the sweet and juicy flavor of fresh strawberries. Whether enjoyed on their own, added to salads, or blended into smoothies, strawberries are a delicious and versatile fruit loved by all. Rich in vitamin C and antioxidants, they support immune health and promote glowing skin. Our strawberries are picked at peak ripeness for maximum flavor and freshness.",
      "price": 4.79,
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "55523",
      "name": "Organic Broccoli",
      "imgUrl": "https://images.freeimages.com/images/large-previews/2e2/fruit-1182045.jpg?fmt=webp&w=500",
      "description": "Nourish your body with the goodness of organic broccoli. Loaded with vitamins, minerals, and antioxidants, broccoli is a nutritional powerhouse that promotes overall health and well-being. Whether steamed, roasted, or added to stir-fries, broccoli adds a delicious crunch and vibrant color to any dish. Grown without synthetic pesticides, our organic broccoli is both nutritious and environmentally friendly.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "66342",
      "name": "Bell Peppers",
      "imgUrl": "https://images.freeimages.com/images/large-previews/a25/fresh-peppers-1181794.jpg?fmt=webp&w=500",
      "description": "Add a pop of color and flavor to your dishes with bell peppers. Whether stuffed, sautéed, or eaten raw, bell peppers are a versatile and delicious addition to any meal. Packed with vitamins and antioxidants, they support immune health and promote overall well-being. Our bell peppers are sourced from local farms, ensuring freshness and quality you can taste.",
      "price": 1.99,
      "Category": "Vegetables",
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "42587",
      "name": "Organic Kale",
      "imgUrl": "https://images.freeimages.com/images/large-previews/e69/colorful-fruits-1329286.jpg?fmt=webp&w=500",
      "description": "Fuel your body with the nutrient-rich goodness of organic kale. Packed with vitamins, minerals, and antioxidants, kale is a superfood that supports overall health and vitality. Whether added to salads, smoothies, or soups, kale adds a hearty texture and vibrant color to any dish. Grown without synthetic pesticides, our organic kale is as pure and wholesome as nature intended.",
      "price": 3.29,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "76859",
      "name": "Fresh Pineapple",
      "imgUrl": "https://images.freeimages.com/images/large-previews/7b6/fruits-1494327.jpg?fmt=webp&w=500",
      "description": "Transport your taste buds to the tropics with fresh pineapple. Bursting with sweet and tangy flavor, pineapple is a refreshing treat for any occasion. Whether enjoyed fresh, grilled, or blended into cocktails, pineapple adds a tropical twist to your favorite recipes. Rich in vitamins, enzymes, and antioxidants, pineapple offers a myriad of health benefits. Our pineapples are handpicked for optimal ripeness and flavor.",
      "price": 4.99,
      "Category": "Fruits",
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "33321",
      "name": "Organic Avocado",
      "imgUrl": "https://images.freeimages.com/images/large-previews/675/supermarket-serie-2-1456665.jpg?fmt=webp&w=500",
      "description": "Indulge in the creamy goodness of organic avocados. Packed with heart-healthy fats, fiber, and vitamins, avocados are a nutritious addition to any diet. Whether mashed into guacamole, sliced onto toast, or blended into smoothies, avocados offer endless culinary possibilities. Grown without synthetic pesticides, our organic avocados are as pure and delicious as nature intended.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "11345",
      "name": "Organic Grapes",
      "imgUrl": "https://images.freeimages.com/images/large-previews/44a/fruit-1185279.jpg?fmt=webp&w=500",
      "description": "Savor the sweet and juicy flavor of organic grapes. Bursting with natural sweetness and antioxidants, grapes are a delicious and nutritious snack for any time of day. Whether enjoyed fresh, frozen, or blended into smoothies, grapes offer a refreshing burst of flavor and a dose of vitality. Our grapes are grown without synthetic pesticides, ensuring pure, unadulterated goodness in every bite.",
      "price": 3.99,
      "Category": "Fruits",
      "rate": 5,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "87213",
      "name": "Organic Spinach",
      "imgUrl": "https://images.freeimages.com/images/large-previews/389/fruits-and-vegetables-of-brazil-4-1326559.jpg?fmt=webp&w=500",
      "description": "Add a nutritious punch to your meals with organic spinach. Loaded with vitamins, minerals, and antioxidants, spinach is a versatile leafy green that can be enjoyed in a variety of dishes. Whether sautéed, blended into smoothies, or added to salads, spinach adds a vibrant burst of color and flavor. Grown without synthetic pesticides, our organic spinach is fresh, flavorful, and packed with goodness.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "62534",
      "name": "Ripe Mangoes",
      "imgUrl": "https://images.freeimages.com/images/large-previews/79d/fruits-and-vegetables-of-brazil-5-1326550.jpg?fmt=webp&w=500",
      "description": "Satisfy your cravings with the tropical sweetness of ripe mangoes. Bursting with juicy flavor and essential nutrients, mangoes are a delicious and healthy snack for any time of day. Whether enjoyed fresh, blended into smoothies, or added to salads, mangoes offer a taste of the tropics wherever you are. Our mangoes are handpicked at peak ripeness to ensure maximum flavor and freshness.",
      "price": 3.49,
      "Category": "Fruits",
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "41237",
      "name": "Fresh Cucumbers",
      "imgUrl": "https://images.freeimages.com/images/large-previews/c03/vegetable-6-1536596.jpg?fmt=webp&w=500",
      "description": "Stay cool and hydrated with crisp and refreshing cucumbers. Whether sliced into salads, pickled, or used as a crunchy snack, cucumbers are a versatile and hydrating addition to any meal. Rich in vitamins, minerals, and antioxidants, they support hydration and overall health. Our cucumbers are sourced from local farms, ensuring superior quality and freshness.",
      "price": 1.49,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "32543",
      "name": "Organic Strawberries",
      "imgUrl": "https://images.freeimages.com/images/large-previews/e3e/food-market-in-madeira-1329185.jpg?fmt=webp&w=500",
      "description": "Indulge in the sweet and juicy flavor of organic strawberries. Bursting with natural sweetness and essential nutrients, strawberries are a delightful addition to any diet. Whether enjoyed fresh, blended into smoothies, or added to desserts, strawberries offer a taste of summer all year round. Grown without synthetic pesticides, our organic strawberries are as pure and delicious as nature intended.",
      "price": 4.99,
      "Category": "Fruits",
      "rate": 5,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "86745",
      "name": "Organic Cauliflower",
      "imgUrl": "https://images.freeimages.com/images/large-previews/0c4/raspberries-1326681.jpg?fmt=webp&w=500",
      "description": "Elevate your meals with the versatility of organic cauliflower. Packed with vitamins, minerals, and antioxidants, cauliflower is a nutritious addition to any diet. Whether roasted, mashed, or blended into soups, cauliflower adds a creamy texture and mild flavor to a variety of dishes. Grown without synthetic pesticides, our organic cauliflower is fresh, flavorful, and perfect for any recipe.",
      "price": 2.79,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "11111",
      "name": "Organic Celery",
      "imgUrl": "https://images.freeimages.com/images/large-previews/715/fruits-shot-2-1537531.jpg?fmt=webp&w=500",
      "description": "Refresh your palate with organic celery. Crisp and crunchy, celery is a versatile vegetable that can be enjoyed raw, added to salads, or used as a flavorful base in soups and stews. Rich in vitamins, minerals, and dietary fiber, celery offers numerous health benefits, from aiding digestion to promoting hydration. Grown without synthetic pesticides, our organic celery is fresh, flavorful, and perfect for snacking or cooking.",
      "price": 1.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "22222",
      "name": "Fresh Pineapple",
      "Category": "Fruits",
      "imgUrl": "https://images.freeimages.com/images/large-previews/f13/fruit-1182041.jpg?fmt=webp&w=500",
      "description": "Transport your taste buds to the tropics with fresh pineapple. Bursting with sweet and tangy flavor, pineapple is a refreshing treat for any occasion. Whether enjoyed fresh, grilled, or blended into cocktails, pineapple adds a tropical twist to your favorite recipes. Rich in vitamins, enzymes, and antioxidants, pineapple offers a myriad of health benefits. Our pineapples are handpicked for optimal ripeness and flavor.",
      "price": 4.99,
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "33333",
      "name": "Organic Zucchini",
      "imgUrl": "https://images.freeimages.com/images/large-previews/ccf/fruits-1322240.jpg?fmt=webp&w=500",
      "description": "Add a nutritious and versatile vegetable to your meals with organic zucchini. Whether grilled, sautéed, or spiralized into noodles, zucchini adds a mild and slightly sweet flavor to a variety of dishes. Rich in vitamins, minerals, and antioxidants, zucchini supports overall health and well-being. Grown without synthetic pesticides, our organic zucchini is fresh, flavorful, and perfect for all your culinary creations.",
      "price": 2.49,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "44444",
      "name": "Fresh Papaya",
      "imgUrl": "https://images.freeimages.com/images/large-previews/44a/fruit-1185279.jpg?fmt=webp&w=500",
      "description": "Indulge in the exotic sweetness of fresh papaya. Bursting with tropical flavor and essential nutrients, papaya is a delicious and nutritious addition to your diet. Whether enjoyed fresh, blended into smoothies, or added to fruit salads, papaya offers a taste of paradise in every bite. Rich in vitamins A and C, papaya supports immune health and glowing skin. Our papayas are handpicked at peak ripeness for maximum flavor and freshness.",
      "price": 3.99,
      "Category": "Fruits",
      "rate": 4,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "55555",
      "name": "Organic Cabbage",
      "imgUrl": "https://images.freeimages.com/images/large-previews/2e2/fruit-1182045.jpg?fmt=webp&w=500",
      "description": "Fuel your body with the goodness of organic cabbage. Packed with vitamins, minerals, and antioxidants, cabbage is a nutritious and versatile vegetable that can be enjoyed raw, cooked, or fermented. Whether shredded into salads, braised, or pickled, cabbage adds a satisfying crunch and vibrant color to any dish. Grown without synthetic pesticides, our organic cabbage is fresh, flavorful, and perfect for all your culinary endeavors.",
      "price": 2.29,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "66666",
      "name": "Fresh Kiwi",
      "imgUrl": "https://images.freeimages.com/images/large-previews/f13/fruit-1182041.jpg?fmt=webp&w=500",
      "description": "Experience the tangy sweetness of fresh kiwi. Bursting with flavor and essential nutrients, kiwi is a delicious and nutritious addition to your fruit basket. Whether sliced, scooped, or blended into smoothies, kiwi offers a refreshing burst of tropical flavor. Rich in vitamin C, fiber, and antioxidants, kiwi supports immune health and digestion. Our kiwis are handpicked for optimal ripeness and flavor.",
      "price": 0.99,
      "Category": "Fruits",
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": true,
      "Discount": true,
      "Expired": false
    },
    {
      "id": "77777",
      "name": "Organic Radishes",
      "imgUrl": "https://images.freeimages.com/images/large-previews/766/vegetable-8-1536612.jpg?fmt=webp&w=500",
      "description": "Add a crisp and peppery bite to your salads with organic radishes. Rich in vitamins, minerals, and antioxidants, radishes are a nutritious and flavorful addition to any dish. Whether thinly sliced, pickled, or roasted, radishes add a refreshing crunch and vibrant color to your meals. Grown without synthetic pesticides, our organic radishes are fresh, flavorful, and perfect for elevating your culinary creations.",
      "price": 1.79,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "88888",
      "name": "Fresh Blueberries",
      "imgUrl": "https://images.freeimages.com/images/large-previews/98c/watermelon-1506864.jpg?fmt=webp&w=500",
      "description": "Indulge in the sweet and tangy flavor of fresh blueberries. Bursting with antioxidants and essential nutrients, blueberries are a delicious and nutritious addition to your diet. Whether enjoyed fresh, added to pancakes, or blended into smoothies, blueberries offer a burst of flavor and health benefits in every bite. Our blueberries are handpicked at peak ripeness for optimal flavor and freshness.",
      "price": 3.49,
      "Category": "Fruits",
      "rate": 5,
      "Organic": false,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "99999",
      "name": "Organic Beets",
      "imgUrl": "https://images.freeimages.com/images/large-previews/2e2/fruit-1182045.jpg?fmt=webp&w=500",
      "description": "Fuel your body with the nutritional powerhouse of organic beets. Rich in vitamins, minerals, and antioxidants, beets offer numerous health benefits, from supporting heart health to boosting exercise performance. Whether roasted, pickled, or juiced, beets add a vibrant color and earthy flavor to your meals. Grown without synthetic pesticides, our organic beets are fresh, flavorful, and perfect for all your culinary endeavors.",
      "price": 2.99,
      "Category": "Vegetables",
      "rate": 4,
      "Organic": true,
      "Fresh": true,
      "Sales": false,
      "Discount": false,
      "Expired": false
    },
    {
      "id": "552",
      "name": "bananaaaa",
      "Category": "Fruits",
      "imgUrl": "https://images.freeimages.com/images/large-previews/9b3/potatoes-1325508.jpg?fmt=webp&w=500",
      "description": "Indulge in the rich and juicy flavor of fresh blackberries. Bursting with antioxidants and essential nutrients, blackberries are a delicious and nutritious addition to your diet. Whether enjoyed fresh, added to yogurt, or baked into pies, blackberries offer a burst of flavor and health benefits in every bite. Our blackberries are handpicked at peak ripeness for optimal flavor and freshness.",
      "price": 90,
      "rate": 2,
      "Organic": true,
      "Fresh": true,
      "Sales": true,
      "Discount": false,
      "Expired": false
    }
  ],
  "admins": [
    {
      "id": "23",
      "userName": "Mostafa Labib",
      "password": "123",
      "email": "labib@gmail.com",
      "phone": "01141389181"
    }
  ]
}